<!DOCTYPE html>
<html>
	<head>
		<title>Gruppo 11 - Home</title>
		<meta content="Nicolo' Caon, Davide Dainese" name="author" />
		<meta content="Homepage del sito e presentazione del gruppo" name="description" />
		<meta charset="UTF-8" />
		<meta lang="it" />
		<meta dir="ltr" />
		<link rel="stylesheet" href="stylesheet.css" type="text/css">
		<script language="javascript" src="script.js"></script>
	</head>
	<body class="sfondo">
		<div id="titolo">Progetto Gruppo 11</div>
			<table id="linktable"><tr>
<td class="linkcell"> <a href="Cronologia.html">Cronologia</a> </td>
<td class="linkcell"> <p id="thispage">Home</p> </td>
<td class="linkcell"> <a href="Canvas.html">Canvas</a> </td>
</tr></table><br />
		<div class="home"> Nella prima pagina &egrave; seplicemente spiegato a cosa questo sito serve, mentre nella seconda &egrave; presente un pulsante 
      		che se schiacciato d&agrave; inizio all'esecuzione del canvas che disegna le stelle.
		&Egrave; possibile inoltre decidere la grandezza delle stelle, questo grazie ad un cursore che va da pi&ugrave; grande 
      		(spostandolo verso destra) a meno grande (verso sinistra).
		</div><br />
		<div class="home"> La disposizione di base non pu&ograve; essere cambiata in quanto predefinita ma sono presenti croci pi&ugrave; grandi e pi&ugrave; piccole 
      		cos&igrave; da migliorare l'impatto visivo, inoltre saranno di colore diverso a seconda della distanza dal 
     		centro del canvas. Possono per&ograve; essere cambiati il numero di ricorsioni, la posizione del centro e la grandezza delle stelle.
		<br />Nell'ultima pagina &egrave; invece presente una cronologia che, per ogni disegno effettuato, tiene conto di tutti i parametri inseriti (ascissa dal centro,
      		ordinata dal centro, numero di ricorsioni e grandezza), la data e ora. Questa cronologia pu&ograve; contenere al massimo i dati di 30 disegni e, se piena, eliminer&agrave; 
		automaticamente i dati dei disegni precedenti per far posto a quelli nuovi.
		</div> <br />
		<div class="home">Il gruppo &egrave; formato da Nicol&ograve; Caon e da Dainese Davide.</div>
		<table id="espandi" onclick="ridere()"><tr><td>Informazioni aggiuntive sui componenti del Gruppo 11</td></tr></table>
		<div class="nascosto" id="aggiunta">
		Nicol&ograve;, gi&agrave; conosciuto per la sua passione per le arti marziali e per la cucina, &egrave; altres&igrave; un famoso chimico, al quale si deve la scoperta del CaON
		(nitrito di calce per essere precisi). Il secondo, appassionato di musica e chitarrista "passabile", si &egrave; guadagnato anche una buona reputazione come programmatore HTML
		tra i suoi compagni di classe, che spesso gli hanno chiesto aiuto. Questo, per&ograve; &egrave; stato possibile solo grazie al sito della W3C, che si &egrave; dimostrato un altrettanto
		"passabile" sostituto al libro di testo nel realizzare le parti di codice pi&ugrave; complesse.
		<i>Attenzione: si avvisa che il composto chimico CaON non esiste in natura :]</i>
		</div><br /><br />
		<div id="controlhistory">
		Il sito utilizza il linguaggio HTML5, perci&ograve; potrebbe avere problemi di compatibilit&agrave; nei browser meno recenti. 
		</div>
	</body>
</html>
